PCIS_prod/src/Catalogs/Этап/Этап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Этап</name>
  <owners>Catalog.Проект</owners>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЭтапа</name>
    <type>
      <types>EnumRef.ЦветЭтапа</types>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задача</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Этап</owners>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Этап/ObjectModule.bsl
///Модуль объекта справочника "Этап"

Процедура ПриЗаписи(Отказ, РежимЗаписи, РежимПроведения)        Если НЕ ЗначениеЗаполнено(ПланДатаНачала) Или НЕ ЗначениеЗаполнено(ПланДатаОкончания) Тогда        Возврат;    КонецЕсли;        Если ПланДатаНачала > ПланДатаОкончания Тогда        Отказ = Истина;        Сообщить("Ошибка: план дата начала не может быть позже даты окончания");        Возврат;    КонецЕсли;        Если НЕ ЗначениеЗаполнено(Владелец) Тогда        Возврат;    КонецЕсли;        ПроектОбъект = Владелец.ПолучитьОбъект();    Если ПроектОбъект = Неопределено Тогда        Возврат;    КонецЕсли;        Если ЗначениеЗаполнено(ПроектОбъект.ПланДатаНачала) И ПланДатаНачала < ПроектОбъект.ПланДатаНачала Тогда        Отказ = Истина;        Сообщить("Ошибка: план дата начала этапа не может быть раньше даты начала проекта");        Возврат;    КонецЕсли;        Если ЗначениеЗаполнено(ПроектОбъект.ПланДатаОкончания) И ПланДатаОкончания > ПроектОбъект.ПланДатаОкончания Тогда        Отказ = Истина;        Сообщить("Ошибка: план дата окончания этапа не может быть позже даты окончания проекта");        Возврат;    КонецЕсли;    	Запрос = Новый Запрос;	Запрос.Текст =	"ВЫБРАТЬ ПЕРВЫЕ 1	|   Задача.Ссылка	|ИЗ	|   Справочник.Задача КАК Задача	|ГДЕ	|   Задача.Владелец = &Этап";		Запрос.УстановитьПараметр("Этап", Ссылка);		Если Запрос.Выполнить().Пустой() Тогда	    Возврат;	КонецЕсли;		Запрос = Новый Запрос;	Запрос.Текст =	"ВЫБРАТЬ	|   Задача.ПланДатаНачала,	|   Задача.ПланДатаОкончания	|ИЗ	|   Справочник.Задача КАК Задача	|ГДЕ	|   Задача.Владелец = &Этап";		Запрос.УстановитьПараметр("Этап", Ссылка);	Выборка = Запрос.Выполнить().Выбрать();		Пока Выборка.Следующий() Цикл	    Если ЗначениеЗаполнено(Выборка.ПланДатаНачала) И Выборка.ПланДатаНачала < ПланДатаНачала Тогда	        Отказ = Истина;	        Сообщить("Ошибка: план дата начала этапа не может быть позже даты начала задачи");	        Возврат;	    КонецЕсли;	    	    Если ЗначениеЗаполнено(Выборка.ПланДатаОкончания) И Выборка.ПланДатаОкончания > ПланДатаОкончания Тогда	        Отказ = Истина;	        Сообщить("Ошибка: план дата окончания этапа не может быть раньше даты окончания задачи");	        Возврат;	    КонецЕсли;	КонецЦикла;    КонецПроцедуры
